#  Задание №1
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные
a = 234
b = '234'
c = 23 / 3
d = True

print(type(a))  # <class 'int'>
print(type(b))  # <class 'str'>
print(type(c))  # <class 'float'>
print(type(d))  # <class 'bool'>
